app/controllers/items_controller.rb

INSERT INTO "items" ("name", "list_id", "created_at", "updated_at", "position") VALUES (?, ?, ?, ?, ?)  [["name", "Item"], ["list_id", 1], ["created_at", "2017-04-25 15:00:43.298972"], ["updated_at", "2017-04-25 15:00:43.298972"], ["position", 1]]
---
  def create
    @item = Item.new(params.require(:item).permit(:name,:list_id))
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
---
  def destroy
    @item = Item.find(params[:id])
    @item.remove_from_list
    @item.destroy

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]
---
  def up
    @item = Item.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 6]]
---
  def down
    @item = Item.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 6]]
---
  def top
    @item = Item.find(params[:id])