app/controllers/lists_controller.rb

  def dashboard
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def create
    @list = List.new(params.require(:list).permit(:name))
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Groceries"], ["created_at", "2017-04-25 14:59:41.781727"], ["updated_at", "2017-04-25 14:59:41.781727"]]

  def view

    @list_id = params[:list_id]
    @list = List.find_by(id: @list_id)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]